const all = [
     {
       id: '19232a95-ccdf-49fd-ba8b-ae86de19fdb9',
       phoneNumber: '897-573-3361',
       inn: '34478897798789',
       fio: 'Крутой Я Контакт',
       name: 'ООО "Я поставщик 12"',
       rank: 0
     },
     {
       id: '687f7786-db5b-4af4-b091-96ab64ff9944',
       phoneNumber: '679-538-0306',
       inn: '34478897798789',
       fio: 'Крутой Я Контакт',
       name: 'ООО "Лиссии"',
       rank: 0
     },
     {
       id: '7754b175-d883-4e07-a2cd-9c237cdc5ffd',
       phoneNumber: '839-849-3813',
       inn: '34478897798789',
       fio: 'Крутой Я Контакт',
       name: 'ООО "Гарантер"',
       rank: 0
     },
     {
       id: '3d49ec17-af09-4f87-a9bd-2f1d2d789253',
       phoneNumber: '323-302-0655',
       inn: '34478897798789',
       fio: 'Крутой Я Контакт',
       name: 'ООО "Гарантер Может"',
       rank: 0
     },
     {
       id: 'ed50b2eb-c1c5-4de7-b970-95376c19e086',
       phoneNumber: '238-603-4443',
       inn: '34478897798789',
       fio: 'Крутой Я Контакт',
       name: 'ООО "Гарантер 2"',
       rank: 0
     },
     {
       id: '7cbab125-ecee-4d0e-b185-c294797de40a',
       phoneNumber: '996-255-9387',
       inn: '34478897798789',
       fio: 'Крутой Я Контакт',
       name: 'ООО "Гарантер 2 Может"',
       rank: 0
     },
     {
       id: 'c495903d-8b75-4672-b419-9b551ffc45cc',
       phoneNumber: '863-655-0334',
       inn: '34478897798789',
       fio: 'Крутой Я Контакт',
       name: 'ООО "Я поставщик 1"',
       rank: 0
     },
     {
       id: '0622f6d4-7cb7-4b4e-a465-9b8702ae4075',
       phoneNumber: '818-249-0948',
       inn: '34478897798789',
       fio: 'Крутой Я Контакт',
       name: 'ООО "Я поставщик 2"',
       rank: 0
     },
     {
       id: 'd86827b5-3f1c-4cdd-80f5-1aa914457fbb',
       phoneNumber: '622-772-2568',
       inn: '34478897798789',
       fio: 'Крутой Я Контакт',
       name: 'ООО "Я от лоялти 1"',
       rank: 0
     },
     {
       id: '8cdab598-ed86-4452-8178-81c4e5d4f08a',
       phoneNumber: '398-859-9476',
       inn: '34478897798789',
       fio: 'Крутой Я Контакт',
       name: 'ООО "Гарантер Может"',
       rank: 0
     },
     {
       id: '32ea6e99-7559-4b81-8cc9-1de342e2f3b6',
       phoneNumber: '435-781-6962',
       fio: 'Крутой Я Контакт',
       name: 'ООО "Я поставщик 12"',
       rank: 0.0607927
     },
     {
       id: '8616908d-3a43-44d4-aa79-85e390836bcb',
       phoneNumber: '372-603-0934',
       fio: 'Крутой Я Контакт',
       name: 'ООО "Лиссии"',
       rank: 0.0607927
     },
     {
       id: '82d83723-3eb6-43e3-821d-d5688148e323',
       phoneNumber: '894-600-4119',
       fio: 'Крутой Я Контакт',
       name: 'ООО "Гарантер"',
       rank: 0.0607927
     },
     {
       id: 'fcf5192e-e26c-47e2-9a44-255ae6d376e8',
       phoneNumber: '422-443-0161',
       fio: 'Крутой Я Контакт',
       name: 'ООО "Гарантер Может"',
       rank: 0.0607927
     },
     {
       id: 'ed18a0ea-1949-4411-ba72-37cd0a3a05e4',
       phoneNumber: '585-598-8886',
       fio: 'Крутой Я Контакт',
       name: 'ООО "Гарантер 2"',
       rank: 0.0607927
     },
     {
       id: 'f2662e0a-c753-401e-aa3e-bb82ed48fa5a',
       phoneNumber: '349-342-8478',
       fio: 'Крутой Я Контакт',
       name: 'ООО "Гарантер 2 Может"',
       rank: 0.0607927
     },
     {
       id: '76dc7b61-3774-421e-aa39-0cf5c9364427',
       phoneNumber: '513-877-9811',
       fio: 'Крутой Я Контакт',
       name: 'ООО "Я поставщик 1"',
       rank: 0.0607927
     },
     {
       id: 'a35444a9-560f-418c-b708-2c6cd4b604f7',
       phoneNumber: '681-610-4216',
       fio: 'Крутой Я Контакт',
       name: 'ООО "Я поставщик 2"',
       rank: 0.0607927
     },
     {
       id: '4c8ba955-20cc-4675-ba10-41dbc72bfff2',
       phoneNumber: '552-737-0904',
       fio: 'Крутой Я Контакт',
       name: 'ООО "Я от лоялти 1"',
       rank: 0.0607927
     },
     {
       id: 'ca542e4c-db64-4832-a1c1-af15d3f6d924',
       phoneNumber: '766-239-8023',
       fio: 'Крутой Я Контакт',
       name: 'ООО "Гарантер Может"',
       rank: 0.0607928
     }
   ]

let c = all.sort((a, b) => b.rank - a.rank)
console.log(c);